tutorials/ADODG3_Wing/runROM/constant/mechanicalProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho
{
    type        uniform;
    value       7854.000000;
}

nu
{
    type        uniform;
    value       0.000000;
}

E
{
    type        uniform;
    value       2.000000e+11;
}

planeStress     false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
